# Final Pandas recap of everything I have learnt Prt 1

In this particular worksheet, I will do the necessary to make sure I have grasped some concept about Pandas and confirm it. I aim to create a csv file and excel file out of the dummy data I will create.

In [1]:
# Imports
import pandas as pd
import numpy as np

In [2]:
# Creating the pandas series
Series_1 = np.array([12, 34, 56, 56, 67, 89])
Series_2 = np.array([13, 45, 34, 56, 34, 56])

df = pd.DataFrame(Series_1)
df

    0
0  12
1  34
2  56
3  56
4  67
5  89

In [3]:
series = pd.DataFrame(Series_2)

new = df.append(series, ignore_index = True)
new

C:\Users\Miss Gloriah\AppData\Local\Temp\ipykernel_12660\385939302.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new = df.append(series, ignore_index = True)

     0
0   12
1   34
2   56
3   56
4   67
5   89
6   13
7   45
8   34
9   56
10  34
11  56

In [4]:
# exploring the series
new.tail()

     0
7   45
8   34
9   56
10  34
11  56

In [5]:
new.head()

    0
0  12
1  34
2  56
3  56
4  67

In [6]:
new.columns

RangeIndex(start=0, stop=1, step=1)

In [7]:
new.std()

0    22.090722
dtype: float64

In [8]:
new.mean()

0    46.0
dtype: float64

In [9]:
new.sum()

0    552
dtype: int64

In [10]:
# Creating a dataframe from a dictionary
data = {'Names': ['Keila', 'Kandra', 'Alex', 'Sonia', 'Maina', 'John', 'Augustine', 'Noordin', 'Kamande'],
       'Age': [23, 45, 34, 56, 78, 56, 78, 45, 34], 
       'Salary': [34000, 56000, 23000, 45000, 56000, 45760, 23450, 37000, 29000], 
       'Credit_score(%)': [3.5, 6.7, 5.0, 3.4, 3.6, 7.8, 2.5, 5.0, 8.9]}

data_frame = pd.DataFrame(data)
data_frame

       Names  Age  Salary  Credit_score(%)
0      Keila   23   34000              3.5
1     Kandra   45   56000              6.7
2       Alex   34   23000              5.0
3      Sonia   56   45000              3.4
4      Maina   78   56000              3.6
5       John   56   45760              7.8
6  Augustine   78   23450              2.5
7    Noordin   45   37000              5.0
8    Kamande   34   29000              8.9

In [11]:
# Creating a new dictionary to add to the exixting dataframe
deta = {'Names': ['Lawrence', 'Ashley', 'Sharon', 'Muli', 'Mungai', 'Samuel', 'Morris', 'Antony', 'Kendi'],
       'Age': [26, 40, 32, 36, 48, 56, 38, 25, 44], 
       'Salary': [24000, 46000, 33000, 55000, 26000, 75760, 33450, 57000, 39000], 
       'Credit_score(%)': [3.5, 6.7, 5.0, 3.4, 3.6, 7.8, 2.5, 5.0, 8.9]}

data_2 = pd.DataFrame(deta)
data_2

      Names  Age  Salary  Credit_score(%)
0  Lawrence   26   24000              3.5
1    Ashley   40   46000              6.7
2    Sharon   32   33000              5.0
3      Muli   36   55000              3.4
4    Mungai   48   26000              3.6
5    Samuel   56   75760              7.8
6    Morris   38   33450              2.5
7    Antony   25   57000              5.0
8     Kendi   44   39000              8.9

In [12]:
# Appending the data into the first dataframe
new_data = data_frame.append(data_2, ignore_index = True, sort = False)

new_data

C:\Users\Miss Gloriah\AppData\Local\Temp\ipykernel_12660\4004232895.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_data = data_frame.append(data_2, ignore_index = True, sort = False)

        Names  Age  Salary  Credit_score(%)
0       Keila   23   34000              3.5
1      Kandra   45   56000              6.7
2        Alex   34   23000              5.0
3       Sonia   56   45000              3.4
4       Maina   78   56000              3.6
5        John   56   45760              7.8
6   Augustine   78   23450              2.5
7     Noordin   45   37000              5.0
8     Kamande   34   29000              8.9
9    Lawrence   26   24000              3.5
10     Ashley   40   46000              6.7
11     Sharon   32   33000              5.0
12       Muli   36   55000              3.4
13     Mungai   48   26000              3.6
14     Samuel   56   75760              7.8
15     Morris   38   33450              2.5
16     Antony   25   57000              5.0
17      Kendi   44   39000              8.9

In [13]:
# Exporting the dataframe as CSV and Excel
new_data.to_csv('credit score_csv')

In [14]:
# Performing manipulation operations
new_data.head()

    Names  Age  Salary  Credit_score(%)
0   Keila   23   34000              3.5
1  Kandra   45   56000              6.7
2    Alex   34   23000              5.0
3   Sonia   56   45000              3.4
4   Maina   78   56000              3.6

In [15]:
new_data.tail()

     Names  Age  Salary  Credit_score(%)
13  Mungai   48   26000              3.6
14  Samuel   56   75760              7.8
15  Morris   38   33450              2.5
16  Antony   25   57000              5.0
17   Kendi   44   39000              8.9

In [16]:
new_data.iloc[2:5]

   Names  Age  Salary  Credit_score(%)
2   Alex   34   23000              5.0
3  Sonia   56   45000              3.4
4  Maina   78   56000              3.6

In [17]:
new_data.iloc[:7]

       Names  Age  Salary  Credit_score(%)
0      Keila   23   34000              3.5
1     Kandra   45   56000              6.7
2       Alex   34   23000              5.0
3      Sonia   56   45000              3.4
4      Maina   78   56000              3.6
5       John   56   45760              7.8
6  Augustine   78   23450              2.5

In [22]:
new_data.sum()

Names              KeilaKandraAlexSoniaMainaJohnAugustineNoordinK...
Age                                                              794
Salary                                                        738420
Credit_score(%)                                                 92.8
dtype: object

In [23]:
new_data.mean()

C:\Users\Miss Gloriah\AppData\Local\Temp\ipykernel_12660\109624642.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  new_data.mean()

Age                   44.111111
Salary             41023.333333
Credit_score(%)        5.155556
dtype: float64

In [24]:
new_data.std()

C:\Users\Miss Gloriah\AppData\Local\Temp\ipykernel_12660\3562617904.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  new_data.std()

Age                   15.992237
Salary             14660.692544
Credit_score(%)        2.134926
dtype: float64